import pandas as pd
from pytest import fixture


@fixture
def dataframe_dat_cat():
    df = pd.DataFrame({
        "Дата операции": ["1.01.2000 00:00:00", "2.01.2000 00:00:00", "3.01.2000 00:00:00", "4.01.2000 00:00:00",
                          "5.01.2000 00:00:00", "6.01.1999 00:00:00"],
        "Категория": ["Топливо", "Супермаркет", "Развлечение", "Топливо", "Переводы", "Топливо"]
    })

    return df


@fixture()
def cat_search_results():
    return [
        {
            "Дата операции": "08.05.2018 18:54:18",
            "Дата платежа": "11.05.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Райффайзенбанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0
        },
        {
            "Дата операции": "27.02.2018 18:48:34",
            "Дата платежа": "02.03.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -52500.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -52500.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Райффайзенбанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 52500.0
        },
        {
            "Дата операции": "22.01.2018 19:24:45",
            "Дата платежа": "25.01.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -22500.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -22500.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Райффайзенбанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 22500.0
        },
        {
            "Дата операции": "22.01.2018 19:23:40",
            "Дата платежа": "25.01.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -30000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -30000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Райффайзенбанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 30000.0
        }
    ]


@fixture
def persons_search_result():
    return [
        {
            "Дата операции": "31.12.2021 00:12:53",
            "Дата платежа": "31.12.2021",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -800.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -800.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Переводы",
            "MCC": None,
            "Описание": "Константин Л.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 800.0
        },
        {
            "Дата операции": "30.12.2021 22:22:03",
            "Дата платежа": "31.12.2021",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -20000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -20000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Переводы",
            "MCC": None,
            "Описание": "Константин Л.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 20000.0
        },
        {
            "Дата операции": "23.12.2021 21:01:32",
            "Дата платежа": "23.12.2021",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -2000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -2000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Переводы",
            "MCC": None,
            "Описание": "Дмитрий Ш.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 2000.0
        },
        {
            "Дата операции": "23.12.2021 16:14:59",
            "Дата платежа": "23.12.2021",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -10000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -10000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Переводы",
            "MCC": None,
            "Описание": "Светлана Т.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 10000.0
        },
        {
            "Дата операции": "19.12.2021 18:38:09",
            "Дата платежа": "19.12.2021",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -186.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -186.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Переводы",
            "MCC": None,
            "Описание": "Андрей Х.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 186.0
        }
    ]
